package main

func main() {
	//基本介绍：
	//1.Tcp socket编程：底层基于TCP/IP协议，例如QQ
	//2.HTTP编程:底层是TCP/IP但是使用的是HTTP协议，例如京东
	//OSI模型(理论)
	//1.应用层(application)
	//2.表示层(presention)
	//3.会话层(session)
	//4.传输层(transport)
	//5.网路层(ip)
	//6.数据链路层(link)
	//7.物理层(physical)
	//Tcp/IP模型(现实)
	//1.应用层(application)
	//2.传输层(transport)
	//3.网路层(ip)
	//4.数据链路层(link)

	//端口的使用：
	//只要是做服务端程序，都必须监听端口
	//该端口就是其他程序和该服务通讯的通道
	//一台电脑有65535的端口1-65535
	//一旦有一个端口被占用，那么其他程序就像不能监听
	//0号是保留端口
	//1-1024是固定端口(既固定程序使用),一般程序员不使用
	//7:echo服务
	//22:SSH远程登录协议
	//21:ftp使用
	//22:SSH登录远程登录协议
	//23:telent使用
	//25:smtp服务使用
	//80:iis使用
	//1025-65535是动态端口:可以任意使用

	//端口使用注意事项：
	//1.要尽可能的少使用端口
	//2.一个端口只能被一个程序监听
	//3.如果使用netstat -an可以查看本机的监听
	//4.可以使用netstat -anb可以查看监听端口pid，在结合任务管理器关闭不安全端口

}
